# 地点配置
PLACES = ['码头', '工厂', '贫民窟', '旅馆', '教堂', '市政厅', '消防局', '池塘', '住宅区', '灯塔', '小巷', '学校', '隧道', '山道', '寺庙', '靶场', '医院', '森林', '海滩', '墓园', '井']
DIRECTIONS = ['东', '南', '西', '北']
DIRECTIONS_ENABLED = False # 是否启用方位

# 角色配置
ROLES = [
    '溪风<劈砍>', '慕容紫英<劈砍>', '夏侯瑾轩<劈砍>',
    '赵灵儿<穿刺>', '龙溟<穿刺>', '楚寒镜<穿刺>',
    '明绣<钝器>', '闲卿<钝器>', '凌波<钝器>',
    '徐长卿<投掷>', '林月如<投掷>', '沈欺霜<投掷>',
    '景天<枪械>', '龙葵<枪械>', '龙阳<枪械>',
    '唐钰<弓箭>', '阿奴<弓箭>', '青儿<弓箭>',
    '云天河<拳掌>', '草谷<拳掌>', '酒剑仙<拳掌>',
    '唐雪见<劈砍>', '苏媚<穿刺>', '云霆<钝器>', '王小虎<投掷>', '楚碧痕<枪械>', '重楼<弓箭>', '唐雨柔<拳掌>',
    '姜云凡<劈砍', '小蛮<穿刺>', '韩菱纱<枪械>', '女苑<弓箭>']
PASSWORDS = ['gzkw51', 'x68295', 'ecb740', 'f72869', 'w91792', 'fnnv10', '666730', 'ml0809', 'z65583', '286034', 'o48277', '685125', 'xh7025', 'pc6638', 'lw9528', 'w69823', 'r29040', 'bdfw85', 'q75297', 'cyy052', 'szg571', '958201', 'vzr223', 'hik272', 'gexb00', '506219', 'a40717', 'xpka61', 'mf2620', 'qt9968', 'wsx43r', '898725']
DIRECTOR_PASSWORD = 'ang708j3'
AUDIENCE_PASSWORD = 'test'

# 道具配置
# 可通过在道具和人物名称中增加"<职业>"来限制人物可使用的道具
# 人物的职业后面可以增加一个字，例如标有<弓箭>的武器可对应标有<弓箭>或<弓箭手>的人物
# 例如"[冷]<弓箭>诸葛连弩"只能被"酌杯<弓箭手>"使用，不能被"小妤<投掷手>"和"取酒"使用
ITEM_HOT_AOE = [] # AOE热武器（带持续伤害）
ITEM_HOT_AOE_DAMAGE = 40
ITEM_HOT_AOE_DAMAGE_LASTED = 10
ITEM_HOT_AOE_TIMES = 5
ITEM_HOT_VITAL = [ # 狙击类热武器
    '[紫]<劈砍>青龙偃月刀', '[紫]<劈砍>盘古斧',
    '[紫]<穿刺>宇宙双叉戟', '[紫]<穿刺>宇宙双叉戟',
    '[紫]<钝器>芭蕉扇', '[紫]<钝器>救世女神像',
    '[紫]<投掷>风魔手里剑', '[紫]<投掷>蔚蓝匕首',
    '[紫]<枪械>北极星', '[紫]<枪械>魔弹射手',
    '[紫]<弓箭>丘比特之弓', '[紫]<弓箭>费尔努特',
    '[紫]<拳掌>血翼指虎', '[紫]<拳掌>布瑞赛尔护手'
]
ITEM_HOT_VITAL_DAMAGE = 20
ITEM_HOT_VITAL_TIMES = 100
ITEM_HOT = [ # 热武器
    '[蓝]<劈砍>大太刀', '[蓝]<劈砍>死神镰刀', '[蓝]<劈砍>斩马刀',
    '[蓝]<穿刺>三叉戟', '[蓝]<穿刺>带电短刀', '[蓝]<穿刺>西洋剑',
    '[蓝]<钝器>双节棍', '[蓝]<钝器>荆棘之鞭', '[蓝]<钝器>白羽扇',
    '[蓝]<投掷>燃烧弹', '[蓝]<投掷>复古扑克', '[蓝]<投掷>强力回力镖',
    '[蓝]<枪械>轻机枪', '[蓝]<枪械>斯太尔AUG', '[蓝]<枪械>AK-47',
    '[蓝]<弓箭>十字弩', '[蓝]<弓箭>诸葛连弩', '[蓝]<弓箭>火矢弓',
    '[蓝]<拳掌>铁砂掌', '[蓝]<拳掌>羽翼指虎', '[蓝]<拳掌>恶魔之爪',
]
ITEM_HOT_DAMAGE = 15
ITEM_HOT_TIMES = 100
ITEM_COLD = [ # 冷兵器
    '[绿]佩剑', '[绿]战斧', '[绿]长矛', '[绿]皮鞭', '[绿]回力镖', '[绿]IM-10', '[绿]复合弓', '[绿]铁爪'
]
ITEM_COLD_DAMAGE = 10
ITEM_COLD_TIMES = 1000
ITEM_ENSURE = [] # 伤害减半
ITEM_PROTECT = ['[防]热情短裙', '[防]神职法衣', '[防]十字军重甲', '[防]管家服', '[防]光学迷彩服', '[防]御史衣', '[防]余晖之铠'] # 抵消若干点伤害
ITEM_PROTECT_VALUE = 5 # 防具抵御的伤害量
ITEM_LOCATOR = ['[GPS]心跳探测仪1', '[GPS]心跳探测仪2'] # 查看道具所在地点（GPS）
ITEM_TELESCOPE = ['[侦]手持式雷达1', '[侦]手持式雷达2'] # 查看人物持有的道具（望远镜）
ITEM_LOCK = ['[锁]生命树枝'] # 锁区域行动（电击棒）
ITEM_SHOW = ['[扬声]圣者之血'] # 大喇叭（公示器）
ITEM_BOMB = ['[炸]遥控地雷', '[炸]双刀断头台'] # 暗杀系手榴弹
ITEM_BOMB_DAMAGE = 30
ITEM_KILL = [] # 暗杀系氰化钾
ITEM_PERFECT_CURE = ['[HP100]红花丹'] # 生命加满并抵消持续伤害
ITEM_PREMIUM_CURE = ['[HP50]十全大补汤'] # 生命+50并抵消持续伤害
ITEM_CURE = ['[HP30]绷带'] # 抵消持续伤害或生命+30
ITEM_BANDAGE = ['[HP10]鸟蛋'] # 抵消持续伤害或生命+10
ITEM_ACTIVE = ['[MP100]威士忌'] # 体力加满
ITEM_WATER = ['[MP50]鸡尾酒'] # 体力+50
ORDINARY_DAMAGE = 5 # 普通攻击伤害值
ITEM_CAPACITY = 6 # 背包容量上限
ITEM_WEAPON_CAPACITY = 2 # 持有武器数量上限
ITEM_OTHERS_CAPACITY = 4 # 持有其它道具数量上限

# 道具合成系统
# 格式：'升级器名称': [['新道具1名称', '所需道具', ...], ['新道具2名称', '所需道具', ...], ...]
# 即一个升级器可对应多个合成公式，使用该升级器时，优先挑选符合目标等级的公式，然后自动挑选第一个满足条件的公式合成
ITEM_TARGET_LEVELS = ['[紫]', '[蓝]']
ITEM_UPGRADE_MAP = {}
ITEM_UPGRADE_GENERATE_MAP = {
    '[合]<劈砍>升级器': [
        ['[紫]<劈砍>青龙偃月刀', '[紫]<劈砍>盘古斧'],
        ['[蓝]<劈砍>大太刀', '[蓝]<劈砍>死神镰刀', '[蓝]<劈砍>斩马刀']
    ],
    '[合]<穿刺>升级器': [
        ['[紫]<穿刺>宇宙双叉戟', '[紫]<穿刺>宇宙双叉戟'],
        ['[蓝]<穿刺>三叉戟', '[蓝]<穿刺>带电短刀', '[蓝]<穿刺>西洋剑']
    ],
    '[合]<钝器>升级器': [
        ['[紫]<钝器>芭蕉扇', '[紫]<钝器>救世女神像'],
        ['[蓝]<钝器>双节棍', '[蓝]<钝器>荆棘之鞭', '[蓝]<钝器>白羽扇']
    ],
    '[合]<投掷>升级器': [
        ['[紫]<投掷>风魔手里剑', '[紫]<投掷>蔚蓝匕首'],
        ['[蓝]<投掷>燃烧弹', '[蓝]<投掷>复古扑克', '[蓝]<投掷>强力回力镖']
    ],
    '[合]<枪械>升级器': [
        ['[紫]<枪械>北极星', '[紫]<枪械>魔弹射手'],
        ['[蓝]<枪械>轻机枪', '[蓝]<枪械>斯太尔AUG', '[蓝]<枪械>AK-47']
    ],
    '[合]<弓箭>升级器': [
        ['[紫]<弓箭>丘比特之弓', '[紫]<弓箭>费尔努特'],
        ['[蓝]<弓箭>十字弩', '[蓝]<弓箭>诸葛连弩', '[蓝]<弓箭>火矢弓']
    ],
    '[合]<拳掌>升级器': [
        ['[紫]<拳掌>血翼指虎', '[紫]<拳掌>布瑞赛尔护手'],
        ['[蓝]<拳掌>铁砂掌', '[蓝]<拳掌>羽翼指虎', '[蓝]<拳掌>恶魔之爪']
    ],
}
for k, v in ITEM_UPGRADE_GENERATE_MAP.items():
    ITEM_UPGRADE_MAP[k] = []
    for x in v[0]:
        for y in v[1]:
            ITEM_UPGRADE_MAP[k].append([x, y])
    for x in v[1]:
        for y in ITEM_COLD:
            ITEM_UPGRADE_MAP[k].append([x, y])
# import pprint
# pprint.pprint(ITEM_UPGRADE_MAP)

# Actions
MOVE = 'move'
SEARCH = 'search'
PICK = 'pick'
ATTACK = 'attack'
EQUIP = 'equip'
USE = 'use'
THROW = 'throw'
DELIVER = 'deliver'

# 体力消耗配置
COSTS = {
    MOVE: 5, SEARCH: 5, PICK: 5, ATTACK: 5, EQUIP: 0, USE: 0, THROW: 0, DELIVER: 5
}
