import base64

users = {
    'last2660': '导演',
    'test': '观众',
    'am6360': '黑长博',
    'zop581': '藤吉文世',
    'qscs43': '松井知里',
    'fk5379': '相马光子',
    'hqw691': '琴弹加代子',
    'bta689': '中川有香',
    'hhi838': '濑户丰',
    'tqf308': '南佳织',
    'wp2534': '元渊恭一',
    '351671': '矢作好美',
    '867316': '日下由美子',
    '727878': '川田章吾',
    'tdb128': '三村信史',
    'x69511': '稻田瑞穗',
    'g32660': '沼井充',
    'guv004': '大木立道',
    'w84640': '山本和彦',
    'q86087': '月冈彰',
    '906184': '饭岛敬太',
    'pa0954': '国信庆时',
    'pegy55': '织田敏宪',
    'y62784': '笹川龙平',
    'm63586': '野田聪美',
    'mv7145': '中川典子',
    'yq5175': '赤松义生',
    'dx6655': '小川樱',
    'ly2947': '仓元洋二',
    'mr9114': '榊祐子',
    'ay3991': '新井田和志',
    'pnu540': '泷口优一郎',
    'khdq30': '金井泉',
    'n35841': '天堂真弓',
    'e19857': '清水比吕乃',
    'id9755': '旗上忠胜',
    'gy7593': '千草贵子',
    'zpfl62': '七原秋也',
    'ukwc03': '江藤惠',
    'y16939': '桐山和雄',
    '488133': '杉村弘树',
    'm61774': '北野雪子',
    'zbn647': '谷泽遥',
    'wqk054': '内海幸枝'
}

user_ids = {
    '导演': 'last2660',
    '观众': 'test',
    '黑长博': 'am6360',
    '藤吉文世': 'zop581',
    '松井知里': 'qscs43',
    '相马光子': 'fk5379',
    '琴弹加代子': 'hqw691',
    '中川有香': 'bta689',
    '濑户丰': 'hhi838',
    '南佳织': 'tqf308',
    '元渊恭一': 'wp2534',
    '矢作好美': '351671',
    '日下由美子': '867316',
    '川田章吾': '727878',
    '三村信史': 'tdb128',
    '稻田瑞穗': 'x69511',
    '沼井充': 'g32660',
    '大木立道': 'guv004',
    '山本和彦': 'w84640',
    '月冈彰': 'q86087',
    '饭岛敬太': '906184',
    '国信庆时': 'pa0954',
    '织田敏宪': 'pegy55',
    '笹川龙平': 'y62784',
    '野田聪美': 'm63586',
    '中川典子': 'mv7145',
    '赤松义生': 'yq5175',
    '小川樱': 'dx6655',
    '仓元洋二': 'ly2947',
    '榊祐子': 'mr9114',
    '新井田和志': 'ay3991',
    '泷口优一郎': 'pnu540',
    '金井泉': 'khdq30',
    '天堂真弓': 'n35841',
    '清水比吕乃': 'e19857',
    '旗上忠胜': 'id9755',
    '千草贵子': 'gy7593',
    '七原秋也': 'zpfl62',
    '江藤惠': 'ukwc03',
    '桐山和雄': 'y16939',
    '杉村弘树': '488133',
    '北野雪子': 'm61774',
    '谷泽遥': 'zbn647',
    '内海幸枝': 'wqk054'
}

def encrypt(key):
    return base64.urlsafe_b64encode(key.encode('ascii')).decode('ascii')

def decrypt(key):
    return base64.urlsafe_b64decode(key.encode('ascii')).decode('ascii')

def has_user(user):
    return user in users

def is_director(user):
    return users[user] == '导演'

def get_id(name):
    name = name.strip()
    return user_ids.get(name, '')
